import setting from './setting.js'
import _ from 'lodash'

export default new class {
  /**
   * @description: 获取别名
   * @param {string} name 要匹配的名称
   * @return {string|false} 未匹配到别名则返回false
   */
  get (name) {
    const aliasList = { ...defAlias, ...setting.getConfig('alias') }
    // 读取角色文件
    if (name in aliasList) return name
    const roleName = _.findKey(aliasList, alias => alias.includes(name))
    if (roleName) {
      return roleName
    } else {
      //logger.warn('[星铁别名]未找到角色')
      return false
    }
  }

  getAllName () {
    // 读取角色文件
    return { ...defAlias, ...setting.getConfig('alias') }
  }
}()
const defAlias = {
  '阿兰': ['Alan', '阿郎', '阿蓝', 'Arlan'],
  '艾丝妲': ['爱思达', '爱丝妲', '爱思妲', '爱丝达', '艾思达', '艾思妲', '艾丝达', '富婆', 'Asta'],
  '白露': ['龙女', '小龙女', '白鹭', '白鹿', '白麓', 'Bailu'],
  '布洛妮娅': ['布诺妮亚', '布洛妮亚', '布诺妮娅', '布洛尼亚', '鸭鸭', '大鸭鸭', 'Bronya'],
  '丹恒': ['单恒', '单垣', '丹垣', '丹桁', '冷面小青龙', 'DanHeng'],
  '黑塔': ['人偶', '转圈圈', 'Herta'],
  '虎克': ['胡克', 'Hook'],
  '姬子': ['机子', '寄子', 'Himeko'],
  '杰帕德': ['杰哥', 'Gepard', '杰帕徳', '杰杰'],
  '景元': ['JingYuan', '景云'],
  '开拓者·存护': ['火爷', '火主', '开拓者存护', '火开拓者'],
  '开拓者·毁灭':['物理爷', '物爷', '物理主', '物主', '开拓者毁灭', '岩开拓者'],
  '克拉拉': ['可拉拉', '史瓦罗', 'Clara'],
  '娜塔莎': ['那塔莎', '那塔沙', '娜塔沙', 'Natasha', '渡鸦'],
  '佩拉': ['配拉', '佩啦', '冰砂糖', 'Pela'],
  '青雀': ['青却', '卿雀', 'Qingque'],
  '三月七': ['三月', '看板娘', '三七', '三祁', '纠缠之缘', 'March7th', '37'],
  '桑博': ['Sampo'],
  '素裳': ['李素裳', 'Sushang'],
  '停云': ['停运', '听云', 'Tingyun'],
  '瓦尔特': ['杨叔', '老杨', 'Welt'],
  '希儿': ['希尔', 'Seele'],
  '希露瓦': ['希录瓦', 'Serval'],
  '彦卿': ['言情', '彦情', '彦青', '言卿', '燕青', 'Yanqing'],
  '银狼': ['淫狼', '音浪', 'yinglang', 'Yinglang', '野狼', '英朗'],
  '罗刹': ['罗差', '罗莎', '落差', '螺子', 'lc', '裸查', 'luocha'],
  '驭空': ['俊空', '军空', 'junk', 'jk', 'yukong'],
  '刃': ['ren', '刀刃', '忍', '任', '人', '仁'],
  '卡芙卡': ['kfk', '卡夫卡', '咖啡', '卡夫', '卡', '夫人', '卡浮卡'],
  '卢卡': ['luka', '格斗家', '拳击手'],
  '符玄': ['fx', '浮选', '复选', '符仙', 'type-c'],
  '丹恒•饮月': ['丹恒饮月', '龙人', '饮月君', '持明龙尊', '小龙人', '饮月'],
  '玲可': ['Lynx', '玲宝'],
  '镜流': ['静流'],
  '托帕&账账': ['托帕','账账','胀胀','帐帐'],
  '桂乃芬': ['奶粉','乃芬','桂奶粉'],
  '藿藿': ['藿藿','霍霍','嚯嚯','祸祸'],
  '银枝': ['音质','纯美骑士'],
  '寒鸦': ['鸦鸦','HANYA','韩雅'],
  '阮•梅': ['阮梅','元梅','妧梅'],
  '真理医生': ['真理','真里'],
  '雪衣': ['雪姨','血衣','雪怡'],
  '椒丘': ['椒大夫','椒师傅','眯眯眼','椒叔','木叔叔','牢椒','老椒'],
  '飞霄': ['飞宵','飞魈','大捷将军','大捷','大杰','大姐','三无将军','三无','天击将军','天击','无敌'],
  '云璃': ['云离','云里'],
  '灵砂': ['菱纱','菱砂','区'],
  '貊泽': ['莫泽','貘泽','墨泽','默泽','陌泽'],
  '三月七·巡猎': ['仙舟三月七','巡猎三月七','虚数三月七','三月七巡猎','三月七虚数'],
  '忘归人': ['fugue','大停云','大狐狸','王贵仁','王贵人','王富贵','富贵','富贵儿','富哥'],
  '星期日': ['sunday','周日哥','周天哥','周天子','七休哥','孙答应','星期天','周末哥','鸡翅膀男孩','小鸡仔','翅膀头','鸡翅膀','工作日','牢日','老日'],
  '乱破': ['忍者','AKA3','缭乱忍侠','忍侠','牢乱','老乱'],
  '大丽花': ['dahlia','大力花','丽花'],
  '大黑塔': ['TheHerta','The Herta','theherta','真黑塔','黑塔本体'],
  '阿格莱雅': ['阿格来雅','阿格莱亚','阿格莱娅','织者','阿宝','阿雅','金织爵','裁缝女','浪漫','浪漫半神','浪漫泰坦','agly','ag','AG','双鞋电风扇'],
  '缇宝': ['提宝','啼宝','缇安','缇宁','提安','提宁','三缇人','缇里西庇俄丝','命运爵','门径','门径半神','门径泰坦'],
  '万敌': ['万迪','万帝','小敌','不死的迈德漠斯','迈德漠斯','歌耳戈之子','歌耳戈','荡平万邦','以一人敌万人','天谴之矛','亡国的王储','蜜果羹','背芒灵官','背芒金刚','纷争','纷争半神','纷争泰坦','牢万','牢敌','老万','老敌'],
  '那刻夏': ['小夏','阿那克萨戈拉斯','那克夏','那可夏','那科夏','那客夏','那刻夏老师','魔术技巧','下课呐','努努斯','树庭居士','那我问你','理性','理性半神','理性泰坦'],
  '赛飞儿': ['贼星','赛法利娅','侠盗','赛菲儿','赛非儿','帕朵','猫猫','大猫猫','大猫咪','赛飞尔','哈基米','猫耳小贼','猫咪怪盗','猫女','猫咪神偷','捷足爵','小猫鱼','诡计','诡计半神','诡计泰坦','牢猫','老猫'],
  '遐蝶': ['蝶','瑕蝶','阿蝶','蝶宝','小蝶','夏蝶','霞蝶','暇蝶','紫霞天女','紫霞','冥河的女儿','冥河之女','死荫的侍女','你蝶','死亡','死亡半神','死亡泰坦'],
  '白厄': ['卡厄斯兰那','黑厄','救世主','房主','小白','烈阳哥','比格椰','比格燚','比格夜','负阳逐火白厄真君','爱上雷神','永劫燔阳','刻法勒','负世','负世半神','负世泰坦'],
  '风堇': ['堇宝','雅辛忒丝','医师','风景','风谨','风馑','风瑾','风锦','粉芭芭拉','粉色芭芭拉','粉毛芭芭拉','白马','小白马','阳光彩虹小白马','彩虹马','天马','小伊卡','摇光爵','天空','天空半神','天空泰坦'],
  '海瑟音': ['海列屈拉','大海的女儿','海色音','拉琴女子','拉琴女','音鲸女子','音鲸','剑旗爵','海洋','海洋半神','海洋泰坦'],
  '刻律德菈': ['君主','刻律德拉','克律得拉','刻律','凯撒','女皇','高人','小皇冠','律法','律法半神','律法泰坦'],
  '长夜月': ['evernight','长夜','长野月','长野原','黑三月','岁月','岁月半神','岁月泰坦'],
  '丹恒•腾荒': ['danhengpt','腾荒','腾荒君','腾荒丹恒','丹恒腾荒','丹恒·腾荒','丹恒腾荒君','丹荒','蛋黄','盾丹','丹腾','存护丹恒','炖蛋','荒笛','大地','大地半神','大地泰坦','丹宝'],
  '昔涟': ['cyrene','喜莲','希莲','希涟','西莲','西涟','昔莲','艾莉','爱莉','迷迷','德谬歌','粉色妖精','桃子','昔米露'],
  'Saber': ['SABER','saber','Sb','SB','吾王','军刀','亚瑟','亚瑟王','金毛','黄毛','呆毛','呆毛王','蓝呆','剑之骑士','剑士','骑士王','棉被王','咖喱棒'],
  'Archer': ['ARCHER','archer','红A','红a','拉矢人','卫宫','士郎','背影帝','卫宫士郎'],
  '火花': ['Sparxie','花火sp','火花花'],
  '爻光': ['yaoguang','摇光','尧光','瑶光','耀光','要逛','腰光','姚光','姚广','荣涛','荣涛将军','戎韬','戎韬将军','爻老板'],
  '真珠': ['pearl','珍珠','真猪'],
  '不死途': ['ashveil','侦探','不死徒','名侦探','牢不','牢不死','牢途','老不死','游侠牢大','游侠老大','老不','老途'],
  '绯英': ['evanescia','绯樱','八重樱','驴','樱花妹','飞鹰'],
  '银狼LV.999': ['sw999','狼尊','999','狼9','9狼','999狼','狼99','狼999','银狼lv.999','银狼lv999','银狼sp','银狼SP','银狼999','sp银狼','零号','金狼'],
  '千冶•刃': ['mortenaxblade','SP刃','刃SP','sp刃','刃sp','千冶刃'],
  '远坂凛': ['tohsakarin','凛','红色恶魔'],
  '吉尔伽美什': ['gilgamesh','金闪闪','闪闪','路灯王','金皮卡','英雄王'],
  '姬子•启行': ['himekonova','姬子SP','SP姬子','姬子sp','sp姬子','姬子·启行','姬子启行','启行姬子'],
  '知更鸟•晴歌': ['知更鸟·晴歌','晴歌','知更鸟晴歌','sp知更鸟','知更鸟SP','知更鸟sp','SP知更鸟','sp鸟','SP鸟','水鸟'],
  '砂金•戏浪': ['砂金·戏浪','戏浪','砂金戏浪','sp砂金','砂金SP','砂金sp','SP砂金','水砂'],
  '穹·欢愉': ['穹欢愉','欢愉穹','欢愉主','欢愉主角','欢愉开拓者','开拓者欢愉','开拓者·欢愉'],
  '星·欢愉': ['星欢愉','欢愉星'],
  '瓦尔特Pro': ['welt2', '老杨加强', '杨叔加强', '瓦尔特杨Pro', '第一律者Pro', '手搓黑洞Pro', '加强版瓦尔特杨', '加强版老杨', '牢杨pro', '老杨pro'],
  '卡芙卡Pro': ['卡芙卡pro', '亲妈Pro', '卡夫卡Pro', '卡妈Pro', '加强卡芙卡', '加强版卡芙卡', '加强版卡夫卡', '加强版卡妈'],
  '银狼Pro': ['银狼pro', '小鸭鸭Pro', '小板鸭Pro', '黑客Pro', '骇客Pro', '骇兔Pro', '憨色鸭Pro', '憨鸭Pro', '加强版银狼', '加强银狼', '银狼加强版', '牢狼pro', '老狼pro'],
  '希儿Pro': ['seele2', '希尔加强', '蝴蝶加强', '云天明', '加强版希尔', '加强版希儿', '地下城女王pro', '希儿•没有姓pro', '电焊师傅pro', '火箭头槌pro', '头部发射器pro', '牢希pro', '老希pro'],
  '刃Pro': ['刃pro', '刃刃Pro', '应星Pro', '加强版刃', '加强刃', '刃加强版', '牢刃pro', '老刃pro'],
  '镜流Pro': ['镜流加强版', '镜流pro', '加强版镜流', '加强镜流', '照彻万川pro', '无罅飞光pro', '牢镜pro', '老镜pro'],
  '藿藿Pro': ['huohuo2', '尾巴Pro', '藿香Pro', '藿去病Pro', '霍去病Pro', '尾巴小跟班Pro', '小怂包Pro', '霍霍加强', '嚯嚯加强', '加强版霍霍', '牢藿pro', '老藿pro'],
  '花火Pro': ['sparkle2', '花火pro', '花火加强版', '加强版花火', '牢花pro', '老花pro'],
  '黑天鹅Pro': ['blackswan2', '黑天鹅pro', '黑天鹅加强版', '加强版黑天鹅', '我又出手了', '神秘出手女', '出手女子', '牢鹅pro', '老鹅pro'],
  '流萤Pro': ['firefly2', 'sam2', '小女友Pro', '萨姆Pro', '萨缪尔Pro', '流莹加强', '流荧加强', '流萤加强', '牢萤pro', '老萤pro'],
}
