export const poolData = [
  {
    id: 'ver1.0up',
    ids: ['2003', '3003'],
    version: '1.0',
    half: '上半',
    from: '2023-04-25 09:00:00',
    to: '2023-05-17 17:59:59',
    poolName: '蝶立锋锷',
    char5: ['希儿'],
    weapon5: ['于夜色中']
  }, {
    id: 'ver1.0down',
    ids: ['2004', '3004'],
    version: '1.0',
    half: '下半',
    from: '2023-05-17 18:00:00',
    to: '2023-06-06 14:59:59',
    poolName: '天戈麾斥',
    char5: ['景元'],
    weapon5: ['拂晓之前']
  }, {
    id: 'ver1.1up',
    ids: ['2005', '3005'],
    version: '1.1',
    half: '上半',
    from: '2023-06-07 10:30:00',
    to: '2023-06-28 11:59:59',
    poolName: '零号协议',
    char5: ['银狼'],
    weapon5: ['雨一直下']
  }, {
    id: 'ver1.1down',
    ids: ['2006', '3006'],
    version: '1.1',
    half: '下半',
    from: '2023-06-28 12:00:00',
    to: '2023-07-18 14:59:59',
    poolName: '寻索世间',
    char5: ['罗刹'],
    weapon5: ['棺的回响']
  }, {
    id: 'ver1.2up',
    ids: ['2007', '3007'],
    version: '1.2',
    half: '上半',
    from: '2023-07-19 10:30:00',
    to: '2023-08-09 11:59:59',
    poolName: '业途游魂',
    char5: ['刃'],
    weapon5: ['到不了的彼岸']
  }, {
    id: 'ver1.2down',
    ids: ['2008', '3008'],
    version: '1.2',
    half: '下半',
    from: '2023-08-09 12:00:00',
    to: '2023-08-29 14:59:59',
    poolName: '夜将不眠',
    char5: ['卡芙卡'],
    weapon5: ['只需等待']
  }, {
    id: 'ver1.3up',
    ids: ['2009', '3009'],
    version: '1.3',
    half: '上半',
    from: '2023-08-30 10:20:00',
    to: '2023-09-20 11:59:59',
    poolName: '濯世垂虹',
    char5: ['丹恒•饮月'],
    weapon5: ['比阳光更明亮的']
  }, {
    id: 'ver1.3down',
    ids: ['2010', '3010'],
    version: '1.3',
    half: '下半',
    from: '2023-09-20 12:00:00',
    to: '2023-10-10 14:59:59',
    poolName: '穷观妙算',
    char5: ['符玄'],
    weapon5: ['她已闭上双眼']
  }, {
    id: 'ver1.4up',
    ids: ['2011', '3011'],
    version: '1.4',
    half: '上半',
    from: '2023-10-11 10:00:00',
    to: '2023-10-27 11:59:59',
    poolName: '月有薄蚀',
    char5: ['镜流'],
    weapon5: ['此身为剑']
  }, {
    id: 'ver1.4down',
    ids: ['2012', '3012'],
    version: '1.4',
    half: '下半',
    from: '2023-10-27 12:00:00',
    to: '2023-11-14 14:59:59',
    poolName: '落日条款',
    char5: ['托帕&账账'],
    weapon5: ['烦恼着，幸福着']
  }, {
    id: 'ver1.5up',
    ids: ['2013', '3013'],
    version: '1.5',
    half: '上半',
    from: '2023-11-15 10:00:00',
    to: '2023-12-06 11:59:59',
    poolName: '令奉贞凶',
    char5: ['藿藿'],
    weapon5: ['惊魂夜']
  }, {
    id: 'ver1.5down',
    ids: ['2014', '3014'],
    version: '1.5',
    half: '下半',
    from: '2023-12-06 12:00:00',
    to: '2023-12-26 14:59:59',
    poolName: '荆冠芳勋',
    char5: ['银枝', '银狼'],
    weapon5: ['片刻，留在眼底', '雨一直下']
  }, {
    id: 'ver1.6up',
    ids: ['2015', '3015'],
    version: '1.6',
    half: '上半',
    from: '2023-12-27 12:00:00',
    to: '2024-01-17 11:59:59',
    poolName: '疏影三迭',
    char5: ['阮·梅', '刃'],
    weapon5: ['镜中故我', '到不了的彼岸']
  }, {
    id: 'ver1.6down',
    ids: ['2016', '3016'],
    version: '1.6',
    half: '下半',
    from: '2024-01-17 12:00:00',
    to: '2024-02-05 14:59:59',
    poolName: '万物皆流',
    char5: ['真理医生', '卡芙卡'],
    weapon5: ['纯粹思维的洗礼', '只需等待']
  }, {
    id: 'ver2.0up',
    ids: ['2017', '3017'],
    version: '2.0',
    half: '上半',
    from: '2024-02-06 12:00:00',
    to: '2024-02-29 11:59:59',
    poolName: '镜映婆娑',
    char5: ['黑天鹅', '丹恒·饮月'],
    weapon5: ['重塑时光之忆', '比阳光更明亮的']
  }, {
    id: 'ver2.0down',
    ids: ['2018', '3018'],
    version: '2.0',
    half: '下半',
    from: '2024-02-29 12:00:00',
    to: '2024-03-26 14:59:59',
    poolName: '焰锦游鱼',
    char5: ['花火', '景元'],
    weapon5: ['游戏尘寰', '拂晓之前']
  }, {
    id: 'ver2.1up',
    ids: ['2019', '3019'],
    version: '2.1',
    half: '上半',
    from: '2024-03-27 12:00:00',
    to: '2024-04-16 11:59:59',
    poolName: '远辞畴昔',
    char5: ['黄泉', '罗刹'],
    weapon5: ['行于流逝的岸', '棺的回响']
  }
]
